import { FaqItem } from "@/types/faq.data";

export const faqData: FaqItem[] = [
    {
      id: 1,
      question: 'Какой характер у мейн-кунов?',
      answer: 'Мейн-куны — это дружелюбные и социальные кошки, которых часто называют "кошками-собаками" за их преданность хозяевам. Они отлично ладят с детьми и другими животными, любят участвовать в семейных делах, но при этом ненавязчивы. Несмотря на крупные размеры, они очень деликатны и аккуратны.'
    },
    {
      id: 2,
      question: 'Какого размера достигают мейн-куны?',
      answer: 'Это одна из самых крупных пород домашних кошек. Взрослые коты могут весить 8-12 кг, а кошки — 5-8 кг. В длину они могут достигать 120 см вместе с хвостом. Растут мейн-куны медленно и окончательно формируются только к 3-5 годам.'
    },
    {
      id: 3,
      question: 'Сложно ли ухаживать за шерстью мейн-куна?',
      answer: 'У мейн-кунов водоотталкивающая шерсть, которая меньше путается, чем у других длинношерстных пород. Достаточно расчесывать 1-2 раза в неделю, а в период линьки — 2-3 раза. Особое внимание уделяйте "гриве" и "штанишкам". Купать часто не требуется — они отлично следят за собой сами.'
    },
    {
      id: 4,
      question: 'Сколько живут мейн-куны?',
      answer: 'При хорошем уходе и правильном питании мейн-куны живут 12-15 лет. Известны случаи, когда представители породы доживали до 18-20 лет. Регулярные посещения ветеринара, вакцинация и качественный корм значительно продлевают жизнь питомца.'
    },
    {
      id: 5,
      question: 'Есть ли у породы предрасположенность к заболеваниям?',
      answer: 'Как и у многих крупных пород, у мейн-кунов есть предрасположенность к гипертрофической кардиомиопатии (ГКМП) и дисплазии тазобедренных суставов. Ответственные заводчики проводят генетическое тестирование и УЗИ сердца, чтобы исключить эти проблемы. В нашем питомнике все животные проверены и имеют соответствующие сертификаты.'
    }
  ];